ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.c

#include "stm32_ll_sai.h"

/* Private define ------------------------------------------------------------*/

/** @defgroup SAI_Private_Constants  SAI Private Constants
 * @{
 */
#define SAI_DEFAULT_TIMEOUT 4U /* 4ms */
#define SAI_LONG_TIMEOUT 1000U
/**
 * @}
 */

/**
 * @}
 */

/** @defgroup SAI_Private_Functions  SAI Private Functions
 * @{
 */
int LL_sai_init(sai_cfg_t *sai_cfg);
static int LL_sai_init_i2s(sai_cfg_t *sai_cfg, uint32_t protocol, uint32_t datasize,
                           uint32_t nbslot);
static int LL_sai_init_pcm(sai_cfg_t *sai_cfg, uint32_t protocol, uint32_t datasize,
                           uint32_t nbslot);
static SAI_Block_TypeDef *LL_get_sai_block(SAI_TypeDef *SAIx, uint32_t block);
static void LL_sai_clear_all_irq(SAI_Block_TypeDef *sai_x);
static uint32_t LL_get_sai_interrupt_flag(SAI_Block_TypeDef *sai, uint32_t protocol,
                                          uint32_t audiomode);
static void LL_sai_flush_fifo(SAI_Block_TypeDef *sai);

/**
 * @}
 */

/* Exported functions ---------------------------------------------------------*/

/** @defgroup SAI_Exported_Functions SAI Exported Functions
 * @{
 */

/** @defgroup SAI_Exported_Functions_Group1 Initialization and de-initialization functions
 *  @brief    Initialization and Configuration functions
 *
@verbatim
 ===============================================================================
      ##### Initialization and de-initialization functions #####
 ===============================================================================
  [..]  This subsection provides a set of functions allowing to initialize and
  de-initialize the SAIx peripheral:

      (+) Call the function sai_init() to configure the selected device with
    the selected configuration:
  (++) Mode (Master/slave TX/RX)
  (++) Protocol
  (++) Data Size
  (++) MCLK Output
  (++) Audio frequency
  (++) FIFO Threshold
  (++) Frame Config
  (++) Slot Config

@endverbatim
  * @{
  */

/**
 * @brief  Initialize the structure FrameInit, slot_cfg and the low part of
 *         Init according to the specified parameters and call the function
 *         sai_init to initialize the SAI block.
 * @param  sai_cfg pointer to a sai_cfg structure that contains
 *               the configuration information for SAI module.
 * @param  protocol one of the supported protocol @ref SAI_Protocol
 * @param  datasize one of the supported datasize @ref SAI_Protocol_DataSize
 *                   the configuration information for SAI module.
 * @param  nbslot Number of slot.
 * @retval 0 = success, else failed
 */
int LL_sai_init_ll_subsystem(SAI_TypeDef *sai, uint32_t protocol, uint32_t datasize,
                             uint32_t audiomode, uint32_t audiofrequency, uint32_t nbslot,
                             uint32_t clk_strobs, uint32_t pclk_div)
{
#if DEBUG_ASSERT
  assert(LL_IS_SAI_ALL_INSTANCE(sai));
  assert(LL_IS_SAI_SUPPORTED_PROTOCOL(protocol));
  assert(LL_IS_SAI_PROTOCOL_DATASIZE(datasize));
  assert(LL_IS_SAI_AUDIO_FREQUENCY(audiofrequency));
  assert(LL_IS_SAI_BLOCK_MODE(audiomode));
  assert(LL_IS_SAI_BLOCK_CLOCK_STROBING(clk_strobs));
  assert(LL_IS_SAI_BLOCK_SLOT_NUMBER(nbslot));
#endif
  sai_cfg_t *sai_cfg = &(sai_cfg_t){.Instance = LL_get_sai_block(sai, SAIx_BLOCK_A),
                                    .init.a_freq = audiofrequency,
                                    .init.audio_mode = audiomode,
                                    .init.clk_strobing = clk_strobs,
                                    .init.clock_div = pclk_div,
                                    .init.b_sync = SAI_ASYNCHRONOUS,
                                    .init.synchro_ext = SAI_SYNCEXT_DISABLE,
                                    .init.stereo_mode = SAI_STEREOMODE,
                                    .init.companding_mode = SAI_NOCOMPANDING,
                                    .init.output_drv = SAI_OUTPUTDRIVE_DISABLE,
                                    .init.fifo_threshold = SAI_FIFOSTATUS_EMPTY,
                                    .init.first_bit = SAI_FIRSTBIT_MSB};

  int status = 0;

  switch (protocol)
  {
  case SAI_I2S_STANDARD:
  case SAI_I2S_MSBJUSTIFIED:
  case SAI_I2S_LSBJUSTIFIED:
    status = LL_sai_init_i2s(sai_cfg, protocol, datasize, nbslot);
    break;
  case SAI_PCM_LONG:
  case SAI_PCM_SHORT:
    status = LL_sai_init_pcm(sai_cfg, protocol, datasize, nbslot);
    break;
  default:
    status = 1;
    break;
  }

  if (status == 0)
  {
    LL_sai_disable_ll_subsystem(sai);
    status = LL_sai_init(sai_cfg);
  }

  return status;
}

/**
 * @brief  Initialize the SAI according to the specified parameters.
 *         in the sai_init_cfg structure and initialize the associated handle.
 * @param  sai_cfg pointer to a sai_cfg structure that contains
 *                the configuration information for SAI module.
 * @retval status (0 = success, else failed)
 */
int LL_sai_init(sai_cfg_t *sai_cfg)
{
  uint32_t tmpregisterGCR = 0;
  uint32_t ckstr_bits = 0;
  uint32_t syncen_bits = 0;

  /* Check the SAI handle allocation */
  if (!sai_cfg)
  {
    return 1;
  }

  /* SAI Block Synchro Configuration -----------------------------------------*/
  /* This setting must be done with both audio block (A & B) disabled         */
  switch (sai_cfg->init.synchro_ext)
  {
  case SAI_SYNCEXT_DISABLE:
    tmpregisterGCR = 0;
    break;
  case SAI_SYNCEXT_OUTBLOCKA_ENABLE:
    tmpregisterGCR = SAI_GCR_SYNCOUT_0;
    break;
  case SAI_SYNCEXT_OUTBLOCKB_ENABLE:
    tmpregisterGCR = SAI_GCR_SYNCOUT_1;
    break;
  default:
    break;
  }

  switch (sai_cfg->init.b_sync)
  {
  case SAI_ASYNCHRONOUS:
    syncen_bits = 0;
    break;
  case SAI_SYNCHRONOUS:
    syncen_bits = SAI_xCR1_SYNCEN_0;
    break;
  case SAI_SYNCHRONOUS_EXT_SAI1:
    syncen_bits = SAI_xCR1_SYNCEN_1;
    break;
  case SAI_SYNCHRONOUS_EXT_SAI2:
    syncen_bits = SAI_xCR1_SYNCEN_1;
    tmpregisterGCR |= SAI_GCR_SYNCIN_0;
    break;

  default:
    break;
  }

  if ((sai_cfg->Instance == SAI1_Block_A) || (sai_cfg->Instance == SAI1_Block_B))
  {
    SAI1->GCR = tmpregisterGCR;
  }
  else
  {

    SAI2->GCR = tmpregisterGCR;
  }

  if (sai_cfg->init.a_freq != SAI_AUDIO_FREQUENCY_MCKDIV)
  {
    /* uint32_t freq = sai_cfg->init.clock_div;
    uint32_t tmpval;

     Configure Master Clock using the following formula :
       MCLK_x = SAI_CK_x / (MCKDIV[3:0] * 2) with MCLK_x = 256 * FS
       FS = SAI_CK_x / (MCKDIV[3:0] * 2) * 256
       MCKDIV[3:0] = SAI_CK_x / FS * 512 */
    /* (freq x 10) to keep Significant digits
    tmpval = (freq * 10) / (sai_cfg->init.a_freq * 2 * 256);*/
    sai_cfg->init.mclk_div = sai_cfg->init.clock_div; // tmpval / 10;

    /* Round result to the nearest integer */
    // if ((tmpval % 10) > 8)
    // {
    //   sai_cfg->init.mclk_div += 1;
    // }

    /* For SPDIF protocol, SAI shall provide a bit clock twice faster the symbol-rate */
    if (sai_cfg->init.protocol == SAI_SPDIF_PROTOCOL)
    {
      sai_cfg->init.mclk_div = sai_cfg->init.mclk_div >> 1;
    }
  }

