ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.c
  /* Compute CKSTR bits of SAI CR1 according ClockStrobing and AudioMode */
  if ((sai_cfg->init.audio_mode == SAI_MODEMASTER_TX) ||
      (sai_cfg->init.audio_mode == SAI_MODESLAVE_TX))
  {
    /* Transmit */
    ckstr_bits = (sai_cfg->init.clk_strobing == SAI_CLOCKSTROBING_RISINGEDGE)
                     ? 0
                     : SAI_xCR1_CKSTR;
  }
  else
  {
    /* Receive */
    ckstr_bits = (sai_cfg->init.clk_strobing == SAI_CLOCKSTROBING_RISINGEDGE)
                     ? SAI_xCR1_CKSTR
                     : 0;
  }

  /* SAI Block Configuration -------------------------------------------------*/
  /* SAI CR1 Configuration */
  sai_cfg->Instance->CR1 &=
      ~(SAI_xCR1_MODE | SAI_xCR1_PRTCFG | SAI_xCR1_DS | SAI_xCR1_LSBFIRST |
        SAI_xCR1_CKSTR | SAI_xCR1_SYNCEN | SAI_xCR1_MONO | SAI_xCR1_OUTDRIV |
        SAI_xCR1_DMAEN | SAI_xCR1_NODIV | SAI_xCR1_MCKDIV);

  sai_cfg->Instance->CR1 |=
      (sai_cfg->init.audio_mode | sai_cfg->init.protocol | sai_cfg->init.data_size |
       sai_cfg->init.first_bit | ckstr_bits | syncen_bits | sai_cfg->init.stereo_mode |
       sai_cfg->init.output_drv | sai_cfg->init.no_divider |
       (sai_cfg->init.mclk_div << 20));

  /* SAI CR2 Configuration */
  sai_cfg->Instance->CR2 &= ~(SAI_xCR2_FTH | SAI_xCR2_FFLUSH | SAI_xCR2_COMP | SAI_xCR2_CPL);
  sai_cfg->Instance->CR2 |= (sai_cfg->init.fifo_threshold | sai_cfg->init.companding_mode |
                             sai_cfg->init.tri_state);

  /* SAI Frame Configuration -----------------------------------------*/
  sai_cfg->Instance->FRCR &= (~(SAI_xFRCR_FRL | SAI_xFRCR_FSALL | SAI_xFRCR_FSDEF |
                                SAI_xFRCR_FSPOL | SAI_xFRCR_FSOFF));
  sai_cfg->Instance->FRCR |=
      ((sai_cfg->frame_init.frame_length - 1) | sai_cfg->frame_init.fs_offset |
       sai_cfg->frame_init.fs_definition | sai_cfg->frame_init.fs_polarity |
       ((sai_cfg->frame_init.active_frame_length - 1) << 8));

  /* SAI Block_x SLOT Configuration ------------------------------------------*/
  /* This register has no meaning in AC 97 and SPDIF audio protocol */
  sai_cfg->Instance->SLOTR &=
      (~(SAI_xSLOTR_FBOFF | SAI_xSLOTR_SLOTSZ | SAI_xSLOTR_NBSLOT | SAI_xSLOTR_SLOTEN));

  sai_cfg->Instance->SLOTR |=
      sai_cfg->slot_init.first_bit_offset | sai_cfg->slot_init.slot_size |
      (sai_cfg->slot_init.slot_active << 16) | ((sai_cfg->slot_init.n_slot - 1) << 8);

  return 0;
}

/**
 * @brief  DeInitialize the SAI peripheral.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (0 = success, else failed)
 */
int LL_sai_deinit_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  /* Check the SAI handle allocation */
  if (!sai)
  {
    return 1;
  }

  /* Disabled All interrupt and clear all the flag */
  LL_sai_clear_all_irq(sai);

  /* Disable the SAI */
  int status = LL_sai_disable_ll_subsystem(sai_x);

  /* Flush the fifo */
  LL_sai_flush_fifo(sai);

  return status;
}
/**
 * @}
 */

/** @defgroup SAI_Exported_Functions_Group2 IO operation functions
  * @brief    Data transfers functions
  *
@verbatim
  ==============================================================================
          ##### IO operation functions #####
  ==============================================================================
  [..]
    This subsection provides a set of functions allowing to manage the SAI data
    transfers.

    (+) There are two modes of transfer:
      (++) Blocking mode : The communication is performed in the polling mode.
     The status of all data processing is returned by the same function
     after finishing transfer.
      (++) No-Blocking mode : The communication is performed using Interrupts
     or DMA. These functions return the status of the transfer startup.
     The end of the data processing will be indicated through the
     dedicated SAI IRQ when using Interrupt mode or the DMA IRQ when
     using DMA mode.

    (+) Blocking mode functions are :
      (++) HAL_SAI_Transmit()
      (++) HAL_SAI_Receive()

@endverbatim
  * @{
  */

/**
 * @brief Abort the current transfer and disable the SAI.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status
 */
int LL_sai_dma_abort_ll_subsystem(SAI_TypeDef *sai_x)
{
  int status = 0;

  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);

  /* Check SAI DMA is enabled or not */
  if ((sai->CR1 & SAI_xCR1_DMAEN) == SAI_xCR1_DMAEN)
  {
    /* Disable the SAI DMA request */
    sai->CR1 &= ~SAI_xCR1_DMAEN;
  }

  return status;
}

/**
 * @brief Resume DMA request on SAI.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_dma_resume_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  /* Flush the fifo */
  // LL_sai_flush_fifo(sai);
  sai->CR1 |= SAI_xCR1_DMAEN;
}

/**
 * @brief  Enable the Tx mute mode.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @param  val  value sent during the mute @ref SAI_Block_Mute_Value
 * @retval status (0 = success, 1 = failed)
 */
void LL_sai_enable_tx_mute_mode_ll_subsystem(SAI_TypeDef *sai_x, uint16_t val)
{
#if DEBUG_ASSERT
  assert(LL_IS_SAI_BLOCK_MUTE_VALUE(val));
#endif
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  LL_CLEAR_BIT(sai->CR2, SAI_xCR2_MUTEVAL | SAI_xCR2_MUTE);
  LL_SET_BIT(sai->CR2, SAI_xCR2_MUTE | val);
}

/**
 * @brief  Disable the Tx mute mode.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_tx_mute_mode_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  LL_CLEAR_BIT(sai->CR2, SAI_xCR2_MUTEVAL | SAI_xCR2_MUTE);
}

/**
 * @brief  SAI Fifo request occurred.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_FREQ_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_xSR_FREQ) == SAI_xSR_FREQ) &&
          ((sai->IMR & SAI_IT_FREQ) == SAI_IT_FREQ));
}

/**
 * @brief  SAI Disable the Overrun underrun interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_OVRUDR_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_OVRUDR);
}

/**
 * @brief  SAI Disable the Mute detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_MUTEDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_MUTEDET);
}

/**
 * @brief  SAI Disable the Wrong Clock Configuration interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_WCKCFG_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_WCKCFG);
}

/**
 * @brief  SAI Disable FIFO request interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_FREQ_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_FREQ);
}

/**
 * @brief  SAI Disable Codec not ready interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_CNRDY_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_CNRDY);
}

/**
 * @brief  SAI Disable Anticipated frame synchronization detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_AFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_AFSDET);
}

/**
 * @brief  SAI Disable Late frame synchronization detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_disable_LFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_DISABLE_IT(sai, SAI_IT_LFSDET);
}

/**
 * @brief  SAI Enable the Overrun underrun interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_OVRUDR_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_OVRUDR);
}

/**
 * @brief  SAI Enable the Mute detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_MUTEDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_MUTEDET);
}

/**
 * @brief  SAI Enable the Wrong Clock Configuration interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_WCKCFG_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_WCKCFG);
}

/**
 * @brief  SAI Enable FIFO request interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_FREQ_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_FREQ);
}

/**
 * @brief  SAI Enable Codec not ready interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_CNRDY_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_CNRDY);
}

/**
 * @brief  SAI Enable Anticipated frame synchronization detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_AFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_AFSDET);
}

/**
 * @brief  SAI Enable Late frame synchronization detection interrupt.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_LFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_ENABLE_IT(sai, SAI_IT_LFSDET);
}

/* Get DMA SAI IO Operation */
/**
 * @brief  Get SAI DMA status.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = busy, 0 = not busy)
 */
int LL_sai_get_dma_status_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return ((sai->CR1 & SAI_xCR1_SAIEN) != RESET);
}

/**
 * @brief  Change Tranfer mode.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_set_transfer_mode_ll_subsystem(SAI_TypeDef *sai_x, uint32_t mode)
{
#ifdef DEBUG_ASSERT
  assert(LL_IS_SAI_BLOCK_MODE(mode));
#endif
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  LL_SET_BIT(sai->CR1, mode);
}
/**
 * @brief  Get SAI data register.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval pointer to __IO uint32_t
 */
__IO uint32_t *LL_sai_get_register_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return &sai->DR;
}

/************** SAI peripheral controls **************************/
/**
 * @brief  Disable the SAI and wait for the disabling.
 * @param  sai  pointer to a SAI_Block_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (0 = success, 1 = failed)
 */
int LL_sai_disable_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  uint32_t count = SAI_DEFAULT_TIMEOUT * WAIT_DELAY;
  int status = 0;

