ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.c
  /* Disable the SAI instance */
  __SAI_DISABLE(sai);

  do
  {
    /* Check for the Timeout */
    if (count-- == 0)
    {
      status = 1;
      break;
    }
  } while ((sai->CR1 & SAI_xCR1_SAIEN) != RESET);

  /* Flush the fifo */
  LL_sai_flush_fifo(sai);

  return status;
}

/**
 * @brief  Disable the SAI and wait for the disabling.
 * @param  sai  pointer to a SAI_Block_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_enable_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  if ((sai->CR1 & SAI_xCR1_SAIEN) == 0U)
  {
    __SAI_ENABLE(sai);
  }
}

/**
 * @brief  Get FIFO empty status.
 * @param  sai  pointer to a SAI_Block_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = empty, 0 = not empty)
 */
int LL_sai_FIFO_empty_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return ((sai->SR & SAI_xSR_FLVL) == SAI_FIFOSTATUS_EMPTY);
}

/*********************** Get Interrupt Event *******************************/

/**
 * @brief  Overrun error occurred.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_OVRUDR_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_OVRUDR) == SAI_FLAG_OVRUDR) &&
          ((sai->IMR & SAI_IT_OVRUDR) == SAI_IT_OVRUDR));
}

/**
 * @brief  Anticipated frame detected.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_AFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_AFSDET) == SAI_FLAG_AFSDET) &&
          ((sai->IMR & SAI_IT_AFSDET) == SAI_IT_AFSDET));
}

/**
 * @brief  Late frame detected.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_LFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_LFSDET) == SAI_FLAG_LFSDET) &&
          ((sai->IMR & SAI_IT_LFSDET) == SAI_IT_LFSDET));
}

/**
 * @brief  Codec not ready detected (only in AC'97 mode).
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_CNRDY_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_CNRDY) == SAI_FLAG_CNRDY) &&
          ((sai->IMR & SAI_IT_CNRDY) == SAI_IT_CNRDY));
}

/**
 * @brief  Incorrect frame length configuration detected.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_WCKCFG_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_WCKCFG) == SAI_FLAG_WCKCFG) &&
          ((sai->IMR & SAI_IT_WCKCFG) == SAI_IT_WCKCFG));
}

/**
 * @brief  Mute frame detected.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval status (1 = occurred, 0 = no request)
 */
int LL_sai_get_MUTEDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  return (((sai->DR & SAI_FLAG_MUTEDET) == SAI_FLAG_MUTEDET) &&
          ((sai->IMR & SAI_IT_MUTEDET) == SAI_IT_MUTEDET));
}

/* Clear Interrupt Event */
/**
 * @brief  Clear overrun under irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_OVRUDR_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_OVRUDR);
}

/**
 * @brief  Clear anticipated irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_AFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_AFSDET);
}

/**
 * @brief  Clear late frame irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_LFSDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_LFSDET);
}

/**
 * @brief  Clear codec not ready irq flag (only in AC'97 mode).
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_CNRDY_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_CNRDY);
}

/**
 * @brief  Clear incorrect frame length configuration irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_WCKCFG_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_WCKCFG);
}

/**
 * @brief  Clear mute frame irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_MUTEDET_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  __SAI_CLEAR_FLAG(sai, SAI_FLAG_MUTEDET);
}

/**
 * @brief  Clear mute frame irq flag.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
void LL_sai_clear_all_ISR_ll_subsystem(SAI_TypeDef *sai_x)
{
  SAI_Block_TypeDef *sai = LL_get_sai_block(sai_x, SAIx_BLOCK_A);
  LL_sai_clear_all_irq(sai);
}

/**
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 * @addtogroup SAI_Private_Functions
 *  @brief      Private functions
 * @{
 */

/**
 * @brief  Initialize the SAI I2S protocol according to the specified parameters
 *         in the SAI_InitTypeDef and create the associated handle.
 * @param  sai_cfg pointer to a sai_cfg_t structure that contains
 *                the configuration information for SAI module.
 * @param  protocol one of the supported protocol.
 * @param  datasize one of the supported datasize @ref SAI_Protocol_DataSize
 *                the configuration information for SAI module.
 * @param  nbslot number of slot minimum value is 2 and max is 16.
 *                    the value must be a multiple of 2.
 * @retval status
 */
static int LL_sai_init_i2s(sai_cfg_t *sai_cfg, uint32_t protocol, uint32_t datasize,
                           uint32_t nbslot)
{
  sai_cfg->init.protocol = SAI_FREE_PROTOCOL;
  sai_cfg->init.first_bit = SAI_FIRSTBIT_MSB;
  /* Compute ClockStrobing according AudioMode */
  if ((sai_cfg->init.audio_mode == SAI_MODEMASTER_TX) ||
      (sai_cfg->init.audio_mode == SAI_MODESLAVE_TX))
  {
    /* Transmit */
    sai_cfg->init.clk_strobing = SAI_CLOCKSTROBING_FALLINGEDGE;
  }
  else
  {
    /* Receive */
    sai_cfg->init.clk_strobing = SAI_CLOCKSTROBING_RISINGEDGE;
  }
  sai_cfg->frame_init.fs_definition = SAI_FS_CHANNEL_IDENTIFICATION;
  sai_cfg->slot_init.slot_active = SAI_SLOTACTIVE_ALL;
  sai_cfg->slot_init.first_bit_offset = 0;
  sai_cfg->slot_init.n_slot = nbslot;

  /* in IS2 the number of slot must be even */
  if ((nbslot & 0x1) != 0)
  {
    return 1;
  }
  if (protocol == SAI_I2S_STANDARD)
  {
    sai_cfg->frame_init.fs_polarity = SAI_FS_ACTIVE_LOW;
    sai_cfg->frame_init.fs_offset = SAI_FS_BEFOREFIRSTBIT;
  }
  else
  {
    /* SAI_I2S_MSBJUSTIFIED or SAI_I2S_LSBJUSTIFIED */
    sai_cfg->frame_init.fs_polarity = SAI_FS_ACTIVE_HIGH;
    sai_cfg->frame_init.fs_offset = SAI_FS_FIRSTBIT;
  }

