ademeyer/zephyr-project/modules/stm32f746_disco_sai/stm32_ll_sai.c
  /* Frame definition */
  switch (datasize)
  {
  case SAI_PROTOCOL_DATASIZE_16BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_16;
    sai_cfg->frame_init.frame_length = 32 * (nbslot / 2);
    sai_cfg->frame_init.active_frame_length = 16 * (nbslot / 2);
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_16B;
    break;
  case SAI_PROTOCOL_DATASIZE_16BITEXTENDED:
    sai_cfg->init.data_size = SAI_DATASIZE_16;
    sai_cfg->frame_init.frame_length = 64 * (nbslot / 2);
    sai_cfg->frame_init.active_frame_length = 32 * (nbslot / 2);
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  case SAI_PROTOCOL_DATASIZE_24BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_24;
    sai_cfg->frame_init.frame_length = 64 * (nbslot / 2);
    sai_cfg->frame_init.active_frame_length = 32 * (nbslot / 2);
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  case SAI_PROTOCOL_DATASIZE_32BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_32;
    sai_cfg->frame_init.frame_length = 64 * (nbslot / 2);
    sai_cfg->frame_init.active_frame_length = 32 * (nbslot / 2);
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  default:
    return 1;
  }
  if (protocol == SAI_I2S_LSBJUSTIFIED)
  {
    if (datasize == SAI_PROTOCOL_DATASIZE_16BITEXTENDED)
    {
      sai_cfg->slot_init.first_bit_offset = 16;
    }
    if (datasize == SAI_PROTOCOL_DATASIZE_24BIT)
    {
      sai_cfg->slot_init.first_bit_offset = 8;
    }
  }
  return 0;
}

/**
 * @brief  Initialize the SAI PCM protocol according to the specified parameters
 *         in the SAI_InitTypeDef and create the associated handle.
 * @param  sai_cfg pointer to a sai_cfg_t structure that contains
 *                the configuration information for SAI module.
 * @param  protocol one of the supported protocol
 * @param  datasize one of the supported datasize @ref SAI_Protocol_DataSize
 * @param  nbslot number of slot minimum value is 1 and the max is 16.
 * @retval status
 */
static int LL_sai_init_pcm(sai_cfg_t *sai_cfg, uint32_t protocol, uint32_t datasize,
                           uint32_t nbslot)
{
  sai_cfg->init.protocol = SAI_FREE_PROTOCOL;
  sai_cfg->init.first_bit = SAI_FIRSTBIT_MSB;
  /* Compute ClockStrobing according AudioMode */
  if ((sai_cfg->init.audio_mode == SAI_MODEMASTER_TX) ||
      (sai_cfg->init.audio_mode == SAI_MODESLAVE_TX))
  {
    /* Transmit */
    sai_cfg->init.clk_strobing = SAI_CLOCKSTROBING_RISINGEDGE;
  }
  else
  {
    /* Receive */
    sai_cfg->init.clk_strobing = SAI_CLOCKSTROBING_FALLINGEDGE;
  }
  sai_cfg->frame_init.fs_definition = SAI_FS_STARTFRAME;
  sai_cfg->frame_init.fs_polarity = SAI_FS_ACTIVE_HIGH;
  sai_cfg->frame_init.fs_offset = SAI_FS_BEFOREFIRSTBIT;
  sai_cfg->slot_init.first_bit_offset = 0;
  sai_cfg->slot_init.n_slot = nbslot;
  sai_cfg->slot_init.slot_active = SAI_SLOTACTIVE_ALL;

  if (protocol == SAI_PCM_SHORT)
  {
    sai_cfg->frame_init.active_frame_length = 1;
  }
  else
  {
    /* SAI_PCM_LONG */
    sai_cfg->frame_init.active_frame_length = 13;
  }

  switch (datasize)
  {
  case SAI_PROTOCOL_DATASIZE_16BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_16;
    sai_cfg->frame_init.frame_length = 16 * nbslot;
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_16B;
    break;
  case SAI_PROTOCOL_DATASIZE_16BITEXTENDED:
    sai_cfg->init.data_size = SAI_DATASIZE_16;
    sai_cfg->frame_init.frame_length = 32 * nbslot;
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  case SAI_PROTOCOL_DATASIZE_24BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_24;
    sai_cfg->frame_init.frame_length = 32 * nbslot;
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  case SAI_PROTOCOL_DATASIZE_32BIT:
    sai_cfg->init.data_size = SAI_DATASIZE_32;
    sai_cfg->frame_init.frame_length = 32 * nbslot;
    sai_cfg->slot_init.slot_size = SAI_SLOTSIZE_32B;
    break;
  default:
    return 1;
  }

  return 0;
}

/**
 * @brief  Disable all interrupts and clear all flags.
 * @param  sai pointer to a SAI_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */

static void LL_sai_clear_all_irq(SAI_Block_TypeDef *sai)
{
  __SAI_DISABLE_IT(sai, 0UL);
  __SAI_CLEAR_FLAG(sai, 0xFFFFFFFFU);
}

/**
 * @brief  Flush the fifo .
 * @param  sai pointer to a SAI_Block_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @retval void
 */
static void LL_sai_flush_fifo(SAI_Block_TypeDef *sai)
{
  LL_SET_BIT(sai->CR2, SAI_xCR2_FFLUSH);
}

/* Retrieve the SAIx Block in use*/
/**
 * @brief This retrieve the SAIx (x = 1 or 2) that is use. .
 * @attention Presently select block A for use, if GCR register is set to
 * synchronous, then we should also configure block B just as A. This
 * is a tempoarary solution till we get more information about it.
 * @param SAIx is a pointer to a SAI_TypeDef and Block to be returned
 *@retval SAI_Block_TypeDef*
 */

static SAI_Block_TypeDef *LL_get_sai_block(SAI_TypeDef *SAIx, uint32_t block)
{
  if (SAIx == SAI2)
  {
    return block == SAIx_BLOCK_A ? SAI2_Block_A : SAI2_Block_B;
  }
  else
  {
    return block == SAIx_BLOCK_A ? SAI1_Block_A : SAI1_Block_B;
  }
}

/**
 * @brief  Return the interrupt flag to set according the SAI setup.
 * @param  sai pointer to a SAI_Block_TypeDef structure that contains
 *                the configuration information for SAI module.
 * @param
 * @retval the list of the IT flag to enable
 */
static uint32_t LL_get_sai_interrupt_flag(SAI_Block_TypeDef *sai, uint32_t protocol,
                                          uint32_t audiomode)
{
  uint32_t tmpIT = SAI_IT_OVRUDR;

  tmpIT |= SAI_IT_FREQ;

  if ((protocol == SAI_AC97_PROTOCOL) &&
      ((audiomode == SAI_MODESLAVE_RX) || (audiomode == SAI_MODEMASTER_RX)))
  {
    tmpIT |= SAI_IT_CNRDY;
  }

  if ((audiomode == SAI_MODESLAVE_RX) || (audiomode == SAI_MODESLAVE_TX))
  {
    tmpIT |= SAI_IT_AFSDET | SAI_IT_LFSDET;
  }
  else
  {
    /* sai has been configured in master mode */
    tmpIT |= SAI_IT_WCKCFG;
  }
  return tmpIT;
}

/**
 * @}
 */
